ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/HSM/f29h85x_hsm_sha_s_regs.xml
<module id="HSM_SHA_S" HW_revision="" description="HSM SHA S Registers">
	<register id="S_ODIGEST_A" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_ODIGEST_B" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_ODIGEST_C" width="32" page="0" offset="8" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_ODIGEST_D" width="32" page="0" offset="12" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_ODIGEST_E" width="32" page="0" offset="16" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_ODIGEST_F" width="32" page="0" offset="20" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_ODIGEST_G" width="32" page="0" offset="24" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_ODIGEST_H" width="32" page="0" offset="28" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_IDIGEST_A" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_IDIGEST_B" width="32" page="0" offset="36" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_IDIGEST_C" width="32" page="0" offset="40" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_IDIGEST_D" width="32" page="0" offset="44" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_IDIGEST_E" width="32" page="0" offset="48" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_IDIGEST_F" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_IDIGEST_G" width="32" page="0" offset="56" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_IDIGEST_H" width="32" page="0" offset="60" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DIGEST_COUNT" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_MODE" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="ALGO" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="ALGO_CONSTANT" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLOSE_HASH" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="HMAC_KEY_PROC" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="REUSE_HMAC_KEY" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="HMAC_OUTER_HASH" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED" description="" begin="31" end="8" width="24" rwaccess="R"/>
	</register>
	<register id="S_LENGTH" width="32" page="0" offset="72" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA0_IN" width="32" page="0" offset="128" internal="0" description="">
		<bitfield id="DATA0_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA1_IN" width="32" page="0" offset="132" internal="0" description="">
		<bitfield id="DATA1_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA2_IN" width="32" page="0" offset="136" internal="0" description="">
		<bitfield id="DATA2_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA3_IN" width="32" page="0" offset="140" internal="0" description="">
		<bitfield id="DATA3_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA4_IN" width="32" page="0" offset="144" internal="0" description="">
		<bitfield id="DATA4_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA5_IN" width="32" page="0" offset="148" internal="0" description="">
		<bitfield id="DATA5_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA6_IN" width="32" page="0" offset="152" internal="0" description="">
		<bitfield id="DATA6_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA7_IN" width="32" page="0" offset="156" internal="0" description="">
		<bitfield id="DATA7_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA8_IN" width="32" page="0" offset="160" internal="0" description="">
		<bitfield id="DATA8_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA9_IN" width="32" page="0" offset="164" internal="0" description="">
		<bitfield id="DATA9_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA10_IN" width="32" page="0" offset="168" internal="0" description="">
		<bitfield id="DATA10_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA11_IN" width="32" page="0" offset="172" internal="0" description="">
		<bitfield id="DATA11_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA12_IN" width="32" page="0" offset="176" internal="0" description="">
		<bitfield id="DATA12_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA13_IN" width="32" page="0" offset="180" internal="0" description="">
		<bitfield id="DATA13_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA14_IN" width="32" page="0" offset="184" internal="0" description="">
		<bitfield id="DATA14_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA15_IN" width="32" page="0" offset="188" internal="0" description="">
		<bitfield id="DATA15_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA16_IN" width="32" page="0" offset="192" internal="0" description="">
		<bitfield id="DATA16_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA17_IN" width="32" page="0" offset="196" internal="0" description="">
		<bitfield id="DATA17_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA18_IN" width="32" page="0" offset="200" internal="0" description="">
		<bitfield id="DATA18_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA19_IN" width="32" page="0" offset="204" internal="0" description="">
		<bitfield id="DATA19_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA20_IN" width="32" page="0" offset="208" internal="0" description="">
		<bitfield id="DATA20_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA21_IN" width="32" page="0" offset="212" internal="0" description="">
		<bitfield id="DATA21_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA22_IN" width="32" page="0" offset="216" internal="0" description="">
		<bitfield id="DATA22_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA23_IN" width="32" page="0" offset="220" internal="0" description="">
		<bitfield id="DATA23_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA24_IN" width="32" page="0" offset="224" internal="0" description="">
		<bitfield id="DATA24_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA25_IN" width="32" page="0" offset="228" internal="0" description="">
		<bitfield id="DATA25_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA26_IN" width="32" page="0" offset="232" internal="0" description="">
		<bitfield id="DATA26_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA27_IN" width="32" page="0" offset="236" internal="0" description="">
		<bitfield id="DATA27_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA28_IN" width="32" page="0" offset="240" internal="0" description="">
		<bitfield id="DATA28_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA29_IN" width="32" page="0" offset="244" internal="0" description="">
		<bitfield id="DATA29_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA30_IN" width="32" page="0" offset="248" internal="0" description="">
		<bitfield id="DATA30_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_DATA31_IN" width="32" page="0" offset="252" internal="0" description="">
		<bitfield id="DATA31_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_REVISION" width="32" page="0" offset="256" internal="0" description="">
		<bitfield id="Y_MINOR" description="" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="X_MAJOR" description="" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="R_RTL" description="" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="FUNC" description="" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="RESERVED1" description="" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="SCHEME" description="" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="S_SYSCONFIG" width="32" page="0" offset="272" internal="0" description="">
		<bitfield id="AUTOIDLE" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOFTRESET" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PIT_EN" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PDMA_EN" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="IDLE_MODE" description="" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="PCONT_SWT" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PADVANCED" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED" description="" begin="31" end="8" width="24" rwaccess="R"/>
	</register>
	<register id="S_SYSSTATUS" width="32" page="0" offset="276" internal="0" description="">
		<bitfield id="RESETDONE" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RESERVED" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="S_IRQSTATUS" width="32" page="0" offset="280" internal="0" description="">
		<bitfield id="OUTPUT_READY" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INPUT_READY" description="" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="PARTHASH_READY" description="" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CONTEXT_READY" description="" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="RESERVED" description="" begin="31" end="4" width="28" rwaccess="R"/>
	</register>
	<register id="S_IRQENABLE" width="32" page="0" offset="284" internal="0" description="">
		<bitfield id="M_OUTPUT_READY" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="M_INPUT_READY" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="M_PARTHASH_READY" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="M_CONTEXT_READY" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED" description="" begin="31" end="4" width="28" rwaccess="R"/>
	</register>
	<register id="S_XSSTATUS" width="32" page="0" offset="320" internal="0" description="">
		<bitfield id="SACCESSED" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SDIRTY" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PACCESSED" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PDIRTY" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED" description="" begin="31" end="4" width="28" rwaccess="R"/>
	</register>
	<register id="S_LOCKDOWN" width="32" page="0" offset="324" internal="0" description="">
		<bitfield id="LOCK_ALGO" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="LOCK_USE_ALOG_CONST" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_CLOSE_HASH" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_HMAC_KEY" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_REUSE_HMAC_KEY" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_HMAC_OUTER_HASH" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED1" description="" begin="23" end="8" width="16" rwaccess="R"/>
		<bitfield id="LOCK_IDIGEST" description="" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_ODIGEST" description="" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_DIGESTCOUNT" description="" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LENGTH" description="" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="BLOCK_ODIGEST_RD" description="" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED2" description="" begin="31" end="29" width="3" rwaccess="R"/>
	</register>
	<register id="S_HASH512_ODIGEST_A" width="32" page="0" offset="512" internal="0" description="">
		<bitfield id="ODIGEST_A" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_B" width="32" page="0" offset="516" internal="0" description="">
		<bitfield id="ODIGEST_B" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_C" width="32" page="0" offset="520" internal="0" description="">
		<bitfield id="ODIGEST_C" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_D" width="32" page="0" offset="524" internal="0" description="">
		<bitfield id="ODIGEST_D" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_E" width="32" page="0" offset="528" internal="0" description="">
		<bitfield id="ODIGEST_E" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_F" width="32" page="0" offset="532" internal="0" description="">
		<bitfield id="ODIGEST_F" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_G" width="32" page="0" offset="536" internal="0" description="">
		<bitfield id="ODIGEST_G" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_H" width="32" page="0" offset="540" internal="0" description="">
		<bitfield id="ODIGEST_H" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_I" width="32" page="0" offset="544" internal="0" description="">
		<bitfield id="ODIGEST_I" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_J" width="32" page="0" offset="548" internal="0" description="">
		<bitfield id="ODIGEST_J" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_K" width="32" page="0" offset="552" internal="0" description="">
		<bitfield id="ODIGEST_K" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_L" width="32" page="0" offset="556" internal="0" description="">
		<bitfield id="ODIGEST_L" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_M" width="32" page="0" offset="560" internal="0" description="">
		<bitfield id="ODIGEST_M" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_N" width="32" page="0" offset="564" internal="0" description="">
		<bitfield id="ODIGEST_N" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_O" width="32" page="0" offset="568" internal="0" description="">
		<bitfield id="ODIGEST_O" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_ODIGEST_P" width="32" page="0" offset="572" internal="0" description="">
		<bitfield id="ODIGEST_P" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_A" width="32" page="0" offset="576" internal="0" description="">
		<bitfield id="IDIGEST_A" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_B" width="32" page="0" offset="580" internal="0" description="">
		<bitfield id="IDIGEST_B" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_C" width="32" page="0" offset="584" internal="0" description="">
		<bitfield id="IDIGEST_C" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_D" width="32" page="0" offset="588" internal="0" description="">
		<bitfield id="IDIGEST_D" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_E" width="32" page="0" offset="592" internal="0" description="">
		<bitfield id="IDIGEST_E" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_F" width="32" page="0" offset="596" internal="0" description="">
		<bitfield id="IDIGEST_F" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_G" width="32" page="0" offset="600" internal="0" description="">
		<bitfield id="IDIGEST_G" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_H" width="32" page="0" offset="604" internal="0" description="">
		<bitfield id="IDIGEST_H" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_I" width="32" page="0" offset="608" internal="0" description="">
		<bitfield id="IDIGEST_I" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_J" width="32" page="0" offset="612" internal="0" description="">
		<bitfield id="IDIGEST_J" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_K" width="32" page="0" offset="616" internal="0" description="">
		<bitfield id="IDIGEST_K" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_L" width="32" page="0" offset="620" internal="0" description="">
		<bitfield id="IDIGEST_L" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_M" width="32" page="0" offset="624" internal="0" description="">
		<bitfield id="IDIGEST_M" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_N" width="32" page="0" offset="628" internal="0" description="">
		<bitfield id="IDIGEST_N" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_O" width="32" page="0" offset="632" internal="0" description="">
		<bitfield id="IDIGEST_O" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_IDIGEST_P" width="32" page="0" offset="636" internal="0" description="">
		<bitfield id="IDIGEST_P" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_DIGEST_COUNT" width="32" page="0" offset="640" internal="0" description="">
		<bitfield id="DIGEST_COUNT" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="S_HASH512_MODE" width="32" page="0" offset="644" internal="0" description="">
		<bitfield id="ALGORITHM" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="USE_ALG_CONSTANTS" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLOSE_HASH" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="HMAC_KEY_PROCESSING" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="REUSE_HMAC_KEY" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="HMAC_OUTER_HASH" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED" description="" begin="31" end="8" width="24" rwaccess="R"/>
	</register>
	<register id="S_HASH512_LENGTH" width="32" page="0" offset="648" internal="0" description="">
		<bitfield id="LENGTH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
</module>
